teatime_start/app/models/user.rb

    def reset_session_token!
      self.session_token = generate_unique_session_token
      self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-09-12 15:59:42.719980"], ["session_token", "[FILTERED]"], ["id", 10]]

    def generate_unique_session_token
      while true
        token = SecureRandom.urlsafe_base64
        return token unless User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]