teatime_start/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "bananaSplit"], ["created_at", "2023-09-12 15:59:42.714340"], ["updated_at", "2023-09-12 15:59:42.714340"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]
---
    def create
        @user = User.new(user_params)
        debugger
        if @user.save